# a = 100

# def test(num):
#     num += num
#     print(num)

# test(a)
# print(a)

# # 运行结果为：
# 200
# 100    # 因为传入的参数a，是一个不可变类型的int，所以函数内部的操作不会改变全局变量a的值；

##############################################################################################

# a = [100]

# def test(num):
#     print(id(num))
#     num += num
#     print(id(num))
#     print(num)

# print(id(a))
# test(a)
# print(id(a))
# print(a)

# # 运行结果为:
140122311918216
140122311918216
140122311918216
[100, 100]
140122311918216
[100, 100] 
# 因为传入的全局变量是可变类型：列表，所以直接修改了；


######################################################################

a = [100]

def test(num):
    print(id(num))
    num = num + num    # 此处相当于在内存中重新生成了一个list——[100,100],并将num的引用指向了它；
    print(id(num))
    print(num)

print(id(a))
test(a)
print(id(a))
print(a)

# 运行结果为：
# 140593842651784
# 140593842651784
# 140593843052104     # 此id为执行完num = num + num 之后的num的id；
# [100, 100]
# 140593842651784
# [100]