
# In [1]: a = (11,22,33,11,22,33)

# In [2]: b = [11,22,33,11,22,33]

# In [3]: a
# Out[3]: (11, 22, 33, 11, 22, 33)

# In [4]: b
# Out[4]: [11, 22, 33, 11, 22, 33]

# In [5]: c = {11,22,33,11,22,33}

# In [6]: c
# Out[6]: {11, 22, 33}

# In [6]: c
# Out[6]: {11, 22, 33}

# In [7]: type(a)
# Out[7]: tuple      # 只读；

# In [8]: type(b)
# Out[8]: list       # 列表支持增删改查；

# In [9]: type(c)
# Out[9]: set        # 不重复；

# 列表去重：
a = [11,22,33,44,11,22,33]
b = []
for i in a:
    if i not in b:
        b.append(i)

# 利用集合去重：
f = set(a)
a = list(f)

